Repository: Sanjeewa1995/vehicle-part-app
Catalog: lib/l10n/app_*.arb
Languages: si, ta

source: Passwords do not match
si: මුරපද නොගැලපේ
ta: கடவுச்சொற்கள் பொருந்தவில்லை

source: Password must be at least 8 characters
si: මුරපදය අවම වශයෙන් අක්ෂර 8 ක් විය යුතුය
ta: கடவுச்சொல் குறைந்தது 8 எழுத்துகள் இருக்க வேண்டும்

# passwordMustBeAtLeast8CharactersLong
source: Your password must be at least 8 characters long.
si: ඔබේ මුරපදය අවම වශයෙන් අක්ෂර 8 ක් විය යුතුය.
ta: உங்கள் கடவுச்சொல் குறைந்தது 8 எழுத்துகள் இருக்க வேண்டும்.

source: Password changed successfully
si: මුරපදය සාර්ථකව වෙනස් කරන ලදී
ta: கடவுச்சொல் வெற்றிகரமாக மாற்றப்பட்டது

source: Failed to change password
si: මුරපදය වෙනස් කිරීමට අසමත් විය
ta: கடவுச்சொல்லை மாற்ற முடியவில்லை

# enterFirstName
source: Enter your first name
si: ඔබේ මුල් නම ඇතුළත් කරන්න
ta: உங்கள் முதல் பெயரை உள்ளிடவும்

# firstNameRequired
source: First name is required
si: මුල් නම අවශ්‍යයි
ta: முதல் பெயர் தேவை

source: First name must be at least 2 characters
si: මුල් නම අවම වශයෙන් අක්ෂර 2 ක් විය යුතුය
ta: முதல் பெயர் குறைந்தது 2 எழுத்துகள் இருக்க வேண்டும்

# enterLastName
source: Enter your last name
si: ඔබේ අවසන් නම ඇතුළත් කරන්න
ta: உங்கள் கடைசி பெயரை உள்ளிடவும்

# lastNameRequired
source: Last name is required
si: අවසන් නම අවශ්‍යයි
ta: கடைசி பெயர் தேவை

source: Last name must be at least 2 characters
si: අවසන් නම අවම වශයෙන් අක්ෂර 2 ක් විය යුතුය
ta: கடைசி பெயர் குறைந்தது 2 எழுத்துகள் இருக்க வேண்டும்

# enterPhoneNumber
source: Enter your phone number
si: ඔබේ දුරකථන අංකය ඇතුළත් කරන්න
ta: உங்கள் தொலைபேசி எண்ணை உள்ளிடவும்

source: Profile updated successfully
si: පැතිකඩ සාර්ථකව යාවත්කාලීන කරන ලදී
ta: சுயவிவரம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது

source: Failed to update profile
si: පැතිකඩ යාවත්කාලීන කිරීමට අසමත් විය
ta: சுயவிவரத்தை புதுப்பிக்க முடியவில்லை

source: Update Profile
si: පැතිකඩ යාවත්කාලීන කරන්න
ta: சுயவிவரத்தை புதுப்பிக்க

source: Postal Code
si: තැපැල් කේතය
ta: அஞ்சல் குறியீடு

# postalCodeRequired
source: Postal code is required
si: තැපැල් කේතය අවශ්‍යයි
ta: அஞ்சல் குறியீடு தேவை

# continueButton
source: Continue
si: ඉදිරියට
ta: தொடர

source: Billing Information
si: බිල්පත් තොරතුරු
ta: பில்லிங் தகவல்

# enterBillingDetails
source: Enter your billing details
si: ඔබේ බිල්පත් තොරතුරු ඇතුළත් කරන්න
ta: உங்கள் பில்லிங் விவரங்களை உள்ளிடவும்

source: Personal Information
si: පුද්ගලික තොරතුරු
ta: தனிப்பட்ட தகவல்

source: Address Information
si: ලිපින තොරතුරු
ta: முகவரி தகவல்

# errorOccurred
source: An error occurred: {error}
si: දෝෂයක් ඇති විය: {error}
ta: பிழை ஏற்பட்டது: {error}

source: My Cart
si: මගේ කරත්තය
ta: எனது கார்ட்

source: Eligible for free delivery
si: නොමිලේ බෙදාහැරීම සඳහා සුදුසු
ta: இலவச விநியோகத்திற்கு தகுதியானது

source: In Stock
si: ගබඩාවේ ඇත
ta: கையிருப்பில் உள்ளது

# quantity
source: Qty
si: ප්‍රමාණය
ta: அளவு

source: Total Amount
si: සම්පූර්ණ මුදල
ta: மொத்த தொகை

source: Proceed to Payment
si: ගෙවීමට ඉදිරියට
ta: கட்டணத்திற்கு தொடர

source: Pay
si: ගෙවන්න
ta: செலுத்த

# phoneLabel
source: Phone
si: දුරකථන
ta: தொலைபேசி

# emailLabel
source: Email
si: ඊමේල්
ta: மின்னஞ்சல்

# billingAddressRequired
source: Billing address is required
si: බිල්පත් ලිපිනය අවශ්‍යයි
ta: பில்லிங் முகவரி தேவை

source: Payment Successful
si: ගෙවීම සාර්ථකයි
ta: கட்டணம் வெற்றிகரமானது

# paymentProcessedSuccessfully
source: Your payment has been processed successfully. Payment ID: {paymentId} Your order will be processed shortly.
si: ඔබේ ගෙවීම සාර්ථකව සැකසී ඇත. ගෙවීම් හැඳුනුම්පත: {paymentId} ඔබේ ඇණවුම ඉක්මනින් සැකසෙනු ඇත.
ta: உங்கள் கட்டணம் வெற்றிகரமாக செயலாக்கப்பட்டது. கட்டண ஐடி: {paymentId} உங்கள் ஆர்டர் விரைவில் செயலாக்கப்படும்.

source: View Orders
si: ඇණවුම් බලන්න
ta: ஆர்டர்களைப் பார்க்க

source: Payment Failed
si: ගෙවීම අසමත් විය
ta: கட்டணம் தோல்வியடைந்தது

# paymentCouldNotBeProcessed
source: Payment could not be processed. Error: {error} Please try again.
si: ගෙවීම සැකසීමට නොහැකි විය. දෝෂය: {error} කරුණාකර නැවත උත්සාහ කරන්න.
ta: கட்டணம் செயலாக்க முடியவில்லை. பிழை: {error} தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# paymentCancelled
source: Payment was cancelled
si: ගෙවීම අවලංගු කරන ලදී
ta: கட்டணம் ரத்து செய்யப்பட்டது
