Repository: Sanjeewa1995/vehicle-part-app
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appTitle
source: Vehicle Parts App
si: වාහන කොටස් යෙදුම
ta: வாகன பாகங்கள் பயன்பாடு

source: Settings
si: සැකසීම්
ta: அமைப்புகள்

source: PROFILE
si: පැතිකඩ
ta: சுயவிவரம்

source: ACCOUNT
si: ගිණුම
ta: கணக்கு

source: SUPPORT
si: සහාය
ta: ஆதரவு

source: Edit Profile
si: පැතිකඩ සංස්කරණය
ta: சுயவிவரத்தைத் திருத்து

# editProfileSubtitle
source: Update your personal information
si: ඔබේ පුද්ගලික තොරතුරු යාවත්කාලීන කරන්න
ta: உங்கள் தனிப்பட்ட தகவல்களை புதுப்பிக்கவும்

source: Change Password
si: මුරපදය වෙනස් කරන්න
ta: கடவுச்சொல்லை மாற்று

# changePasswordSubtitle
source: Update your password
si: ඔබේ මුරපදය යාවත්කාලීන කරන්න
ta: உங்கள் கடவுச்சொல்லை புதுப்பிக்கவும்

source: Privacy & Security
si: රහස්‍යතාව හා ආරක්ෂාව
ta: தனியுரிமை மற்றும் பாதுகாப்பு

# privacySecuritySubtitle
source: Manage your privacy settings
si: ඔබේ රහස්‍යතා සැකසීම් කළමනාකරණය කරන්න
ta: உங்கள் தனியுரிமை அமைப்புகளை நிர்வகிக்கவும்

source: Help & Support
si: උදව් හා සහාය
ta: உதவி மற்றும் ஆதரவு

# helpSupportSubtitle
source: Get help and contact support
si: උදව් ලබාගෙන සහාය අමතන්න
ta: உதவி பெறவும் மற்றும் ஆதரவைத் தொடர்பு கொள்ளவும்

source: Privacy Policy
si: රහස්‍යතා ප්‍රතිපත්තිය
ta: தனியுரிமைக் கொள்கை

# privacyPolicySubtitle
source: Read our privacy policy
si: අපගේ රහස්‍යතා ප්‍රතිපත්තිය කියවන්න
ta: எங்கள் தனியுரிமைக் கொள்கையைப் படிக்கவும்

source: Terms of Service
si: සේවා කොන්දේසි
ta: சேவை விதிமுறைகள்

# termsOfServiceSubtitle
source: Read our terms of service
si: අපගේ සේවා කොන්දේසි කියවන්න
ta: எங்கள் சேவை விதிமுறைகளைப் படிக்கவும்

source: About
si: පිළිබඳව
ta: பற்றி

# aboutSubtitle
source: App version and information
si: යෙදුමේ අනුවාදය සහ තොරතුරු
ta: பயன்பாட்டு பதிப்பு மற்றும் தகவல்

source: Logout
si: පිටවීම
ta: வெளியேறு

# logoutSubtitle
source: Sign out of your account
si: ඔබේ ගිණුමෙන් පිටවන්න
ta: உங்கள் கணக்கிலிருந்து வெளியேறு

source: Language
si: භාෂාව
ta: மொழி

# languageSubtitle
source: Choose your preferred language
si: ඔබේ ප්‍රියතම භාෂාව තෝරන්න
ta: உங்கள் விருப்பமான மொழியைத் தேர்ந்தெடுக்கவும்

source: Coming Soon
si: ඉක්මණින් පැමිණෙන
ta: விரைவில் வருகிறது

# comingSoonMessage
source: {feature} will be available soon.
si: {feature} ඉක්මණින් ලබා ගත හැකිය.
ta: {feature} விரைவில் கிடைக்கும்.

source: OK
si: හරි
ta: சரி

# aboutTitle
source: About M AUTO-ZONE
si: M AUTO-ZONE පිළිබඳව
ta: M AUTO-ZONE பற்றி

# aboutMessage
source: Version 1.0.0 Your trusted partner for quality auto parts. © 2025 M AUTO-ZONE. All rights reserved.
si: අනුවාදය 1.0.0 ගුණාත්මක රථ කොටස් සඳහා ඔබේ විශ්වාසදායක සහකරු. © 2025 M AUTO-ZONE. සියලුම හිමිකම් ඇවිරිණි.
ta: பதிப்பு 1.0.0 தரமான வாகன பாகங்களுக்கான உங்கள் நம்பகமான பங்குதாரர். © 2025 M AUTO-ZONE. அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை.

# logoutTitle
source: Logout
si: පිටවීම
ta: வெளியேறு

# logoutMessage
source: Are you sure you want to logout?
si: ඔබට ඇත්තටම පිටවීමට අවශ්‍යද?
ta: நீங்கள் உண்மையில் வெளியேற விரும்புகிறீர்களா?

source: Cancel
si: අවලංගු කරන්න
ta: ரத்துசெய்

source: Select Language
si: භාෂාව තෝරන්න
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: Welcome Back
si: ආපසු සාදරයෙන් පිළිගනිමු
ta: மீண்டும் வரவேற்கிறோம்

# signInToContinue
source: Sign in to continue to your account
si: ඔබේ ගිණුමට ඇතුළු වීමට පුරනය වන්න
ta: உங்கள் கணக்கில் தொடர உள்நுழையவும்

source: Email Address
si: ඊමේල් ලිපිනය
ta: மின்னஞ்சல் முகவரி

source: Enter your email
si: ඔබේ ඊමේල් ඇතුළත් කරන්න
ta: உங்கள் மின்னஞ்சலை உள்ளிடவும்

source: Password
si: මුරපදය
ta: கடவுச்சொல்

source: Enter your password
si: ඔබේ මුරපදය ඇතුළත් කරන්න
ta: உங்கள் கடவுச்சொல்லை உள்ளிடவும்

source: Forgot Password?
si: මුරපදය අමතකද?
ta: கடவுச்சொல் மறந்துவிட்டதா?

source: Sign In
si: පුරනය වන්න
ta: உள்நுழைய

# emailRequired
source: Email is required
si: ඊමේල් අවශ්‍යයි
ta: மின்னஞ்சல் தேவை

# validEmailRequired
source: Please enter a valid email
si: කරුණාකර වලංගු ඊමේල් ලිපිනයක් ඇතුළත් කරන්න
ta: சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்

# passwordRequired
source: Password is required
si: මුරපදය අවශ්‍යයි
ta: கடவுச்சொல் தேவை

# passwordMinLength
source: Password must be at least 6 characters
si: මුරපදය අවම වශයෙන් අක්ෂර 6 ක් විය යුතුය
ta: கடவுச்சொல் குறைந்தது 6 எழுத்துகள் இருக்க வேண்டும்

source: Good Morning
si: සුභ උදෑසනක්
ta: காலை வணக்கம்

source: Good Afternoon
si: සුභ දහවලක්
ta: மதிய வணக்கம்

source: Good Evening
si: සුභ සන්ධ්‍යාවක්
ta: மாலை வணக்கம்

source: Quick Actions
si: ඉක්මන් ක්‍රියා
ta: விரைவு செயல்கள்

source: View All
si: සියල්ල බලන්න
ta: அனைத்தையும் பார்க்க

source: Request Spare Part
si: උපකරණ කොටසක් ඉල්ලන්න
ta: ஸ்பேர் பாகத்தை கோரவும்

# findPartYouNeed
source: Find the part you need
si: ඔබට අවශ්‍ය කොටස සොයන්න
ta: உங்களுக்கு தேவையான பகுதியைக் கண்டறியவும்

source: My Requests
si: මගේ ඉල්ලීම්
ta: எனது கோரிக்கைகள்

source: View your requests
si: ඔබේ ඉල්ලීම් බලන්න
ta: உங்கள் கோரிக்கைகளைப் பார்க்கவும்

source: Add Request
si: ඉල්ලීමක් එක් කරන්න
ta: கோரிக்கையைச் சேர்க்க

source: Create New Request
si: නව ඉල්ලීමක් සාදන්න
ta: புதிய கோரிக்கையை உருவாக்க

source: Home
si: මුල් පිටුව
ta: வீடு

source: Requests
si: ඉල්ලීම්
ta: கோரிக்கைகள்

source: Products
si: නිෂ්පාදන
ta: தயாரிப்புகள்

source: Cart
si: කරත්තය
ta: கார்ட்

source: Loading cart...
si: කරත්තය පූරණය වෙමින්...
ta: கார்ட் ஏற்றுகிறது...

# emptyCart
source: Your cart is empty
si: ඔබේ කරත්තය හිස්ය
ta: உங்கள் கார்ட் காலியாக உள்ளது

source: Start Shopping
si: සාප්පුවට යන්න
ta: ஷாப்பிங் தொடங்க

source: Total
si: සම්පූර්ණ
ta: மொத்தம்

source: Checkout
si: ගෙවීම
ta: செக்அவுட்

source: items
si: අයිතම
ta: பொருட்கள்

source: item
si: අයිතමය
ta: பொருள்

source: Your Cart is Empty
si: ඔබේ කරත්තය හිස්ය
ta: உங்கள் கார்ட் காலியாக உள்ளது

# cartEmptyMessage
source: Looks like you haven't added anything to your cart yet
si: ඔබ තවමත් කරත්තයට කිසිවක් එක් කර නැත
ta: நீங்கள் இன்னும் உங்கள் கார்ட்டில் எதையும் சேர்க்கவில்லை

source: Browse Requests
si: ඉල්ලීම් පිරික්සන්න
ta: கோரிக்கைகளை உலாவு

source: Delivery
si: බෙදාහැරීම
ta: விநியோகம்

source: Free
si: නොමිලේ
ta: இலவசம்

source: Order Total
si: ඇණවුම් මුළු
ta: ஆர்டர் மொத்தம்

source: Proceed to Buy
si: මිලදී ගැනීමට ඉදිරියට
ta: வாங்குவதற்கு தொடர

# helpSupportTitle
source: Help & Support
si: උදව් හා සහාය
ta: உதவி மற்றும் ஆதரவு

source: Welcome to Help Center
si: උදව් මධ්‍යස්ථානයට සාදරයෙන් පිළිගනිමු
ta: உதவி மையத்திற்கு வரவேற்கிறோம்

# findAnswersAndLearn
source: Find answers and learn how to use AUTO-ZONE
si: පිළිතුරු සොයාගෙන AUTO-ZONE භාවිතා කරන්නේ කෙසේදැයි ඉගෙන ගන්න
ta: பதில்களைக் கண்டறிந்து AUTO-ZONE ஐ எவ்வாறு பயன்படுத்துவது என்பதை அறிக

# howToRequestSparePart
source: How to Request a Spare Part
si: උපකරණ කොටසක් ඉල්ලන්නේ කෙසේද
ta: ஸ்பேர் பாகத்தை எவ்வாறு கோருவது

source: Tap "Add Request"
si: "ඉල්ලීමක් එක් කරන්න" තට්ටු කරන්න
ta: "கோரிக்கையைச் சேர்" என்பதைத் தட்டவும்

# tapAddRequestDesc
source: From the home screen, tap the "Add Request" button or navigate to the Requests section.
si: මුල් පිටුවෙන් "ඉල්ලීමක් එක් කරන්න" බොත්තම තට්ටු කරන්න හෝ ඉල්ලීම් කොටසට යන්න.
ta: முகப்புத் திரையில் இருந்து "கோரிக்கையைச் சேர்" பொத்தானைத் தட்டவும் அல்லது கோரிக்கைகள் பிரிவுக்குச் செல்லவும்.

source: Fill Vehicle Information
si: වාහන තොරතුරු පුරවන්න
ta: வாகன தகவலை நிரப்பவும்

# fillVehicleInformationDesc
source: Enter your vehicle type, model, and year. Upload a photo of your vehicle if available.
si: ඔබේ වාහන වර්ගය, ආකෘතිය සහ වසර ඇතුළත් කරන්න. හැකි නම් ඔබේ වාහනයේ ඡායාරූපයක් උඩුගත කරන්න.
ta: உங்கள் வாகன வகை, மாதிரி மற்றும் ஆண்டை உள்ளிடவும். கிடைக்குமானால் உங்கள் வாகனத்தின் புகைப்படத்தை பதிவேற்றவும்.

source: Add Part Details
si: කොටස් තොරතුරු එක් කරන්න
ta: பாக விவரங்களைச் சேர்க்க

# addPartDetailsDesc
source: Specify the part name, part number (if known), and provide a detailed description.
si: කොටස් නම, කොටස් අංකය (දන්නා නම්) සඳහන් කර සවිස්තරාත්මක විස්තරයක් සපයන්න.
ta: பாகத்தின் பெயர், பாக எண் (தெரிந்தால்) குறிப்பிட்டு விரிவான விளக்கத்தை வழங்கவும்.

source: Upload Images/Video
si: රූප/වීඩියෝ උඩුගත කරන්න
ta: படங்கள்/வீடியோ பதிவேற்ற

# uploadImagesVideoDesc
source: Add photos of the part or vehicle area where the part is needed. You can also upload a video.
si: කොටසේ හෝ කොටස අවශ්‍ය වාහන ප්‍රදේශයේ ඡායාරූප එක් කරන්න. ඔබට වීඩියෝවක් ද උඩුගත කළ හැකිය.
ta: பாகத்தின் அல்லது பாகம் தேவைப்படும் வாகன பகுதியின் புகைப்படங்களைச் சேர்க்கவும். நீங்கள் ஒரு வீடியோவையும் பதிவேற்றலாம்.

source: Submit Request
si: ඉල්ලීම ඉදිරිපත් කරන්න
ta: கோரிக்கையை சமர்ப்பிக்க

# submitRequestDesc
source: Review your information and submit the request. You'll receive updates on your request status.
si: ඔබේ තොරතුරු සමාලෝචනය කර ඉල්ලීම ඉදිරිපත් කරන්න. ඔබේ ඉල්ලීමේ තත්වය පිළිබඳ යාවත්කාලීන කිරීම් ඔබට ලැබෙනු ඇත.
ta: உங்கள் தகவலை மதிப்பாய்வு செய்து கோரிக்கையை சமர்ப்பிக்கவும். உங்கள் கோரிக்கை நிலையில் புதுப்பித்தல்களைப் பெறுவீர்கள்.

source: Managing Your Requests
si: ඔබේ ඉල්ලීම් කළමනාකරණය
ta: உங்கள் கோரிக்கைகளை நிர்வகித்தல்

source: View All Requests
si: සියලුම ඉල්ලීම් බලන්න
ta: அனைத்து கோரிக்கைகளையும் பார்க்க

# viewAllRequestsDesc
source: Go to "My Requests" from the home screen to see all your submitted requests and their current status.
si: ඔබේ සියලුම ඉදිරිපත් කළ ඉල්ලීම් සහ ඒවායේ වර්තමාන තත්වය බැලීමට මුල් පිටුවෙන් "මගේ ඉල්ලීම්" වෙත යන්න.
ta: முகப்புத் திரையில் இருந்து "எனது கோரிக்கைகள்"க்குச் சென்று உங்கள் அனைத்து சமர்ப்பிக்கப்பட்ட கோரிக்கைகள் மற்றும் அவற்றின் தற்போதைய நிலையைப் பார்க்கவும்.

source: Request Status
si: ඉල්ලීමේ තත්වය
ta: கோரிக்கை நிலை

# requestStatusDesc
source: Track your requests with status indicators: Pending, In Progress, Completed, or Cancelled.
si: තත්ව දර්ශක සමඟ ඔබේ ඉල්ලීම් ලුහුබැඳීම: අපේක්ෂාවෙන්, සැකසීමේ, සම්පූර්ණ, හෝ අවලංගු කරන ලද.
ta: நிலை குறிகாட்டிகளுடன் உங்கள் கோரிக்கைகளைக் கண்காணிக்கவும்: நிலுவையில், முன்னேற்றத்தில், முடிக்கப்பட்டது அல்லது ரத்து செய்யப்பட்டது.

source: View Request Details
si: ඉල්ලීම් තොරතුරු බලන්න
ta: கோரிக்கை விவரங்களைப் பார்க்க

# viewRequestDetailsDesc
source: Tap on any request card to see full details, including vehicle information, part details, and attached media.
si: වාහන තොරතුරු, කොටස් තොරතුරු සහ ඇමිණුම් මාධ්‍ය ඇතුළු සම්පූර්ණ තොරතුරු බැලීමට ඕනෑම ඉල්ලීම් කාඩ්පතක් තට්ටු කරන්න.
ta: வாகன தகவல், பாக விவரங்கள் மற்றும் இணைக்கப்பட்ட ஊடகம் உட்பட முழு விவரங்களைப் பார்க்க எந்த கோரிக்கை அட்டையையும் தட்டவும்.

source: Frequently Asked Questions
si: නිතර අසන ප්‍රශ්න
ta: அடிக்கடி கேட்கப்படும் கேள்விகள்

# faqProcessingTime
source: How long does it take to process a request?
si: ඉල්ලීමක් සැකසීමට කොපමණ කාලයක් ගතවේද?
ta: கோரிக்கையை செயலாக்க எவ்வளவு நேரம் ஆகும்?

# faqProcessingTimeAnswer
source: Request processing time varies depending on part availability. Typically, you'll receive a response within 24-48 hours.
si: ඉල්ලීම් සැකසීමේ කාලය කොටස් ලබා ගැනීම මත රඳා පවතී. සාමාන්‍යයෙන්, ඔබට පැය 24-48 ක් තුළ ප්‍රතිචාරයක් ලැබෙනු ඇත.
ta: கோரிக்கை செயலாக்க நேரம் பாக கிடைக்கும் தன்மையைப் பொறுத்து மாறுபடும். பொதுவாக, நீங்கள் 24-48 மணி நேரத்திற்குள் பதிலைப் பெறுவீர்கள்.

# faqEditCancel
source: Can I edit or cancel my request?
si: මට මගේ ඉල්ලීම සංස්කරණය කිරීමට හෝ අවලංගු කිරීමට හැකිද?
ta: நான் எனது கோரிக்கையைத் திருத்தலாமா அல்லது ரத்து செய்யலாமா?

# faqEditCancelAnswer
source: You can view your request details, but editing and cancellation features are currently being developed.
si: ඔබට ඔබේ ඉල්ලීම් තොරතුරු බැලිය හැකි නමුත් සංස්කරණය සහ අවලංගු කිරීමේ විශේෂාංග දැනට සංවර්ධනය වෙමින් පවතී.
ta: நீங்கள் உங்கள் கோரிக்கை விவரங்களைப் பார்க்கலாம், ஆனால் திருத்துதல் மற்றும் ரத்துசெய்தல் அம்சங்கள் தற்போது உருவாக்கப்பட்டு வருகின்றன.

# faqWhatInformation
source: What information should I include?
si: මට කුමන තොරතුරු ඇතුළත් කළ යුතුද?
ta: நான் என்ன தகவலைச் சேர்க்க வேண்டும்?

# faqWhatInformationAnswer
source: Provide as much detail as possible: vehicle make, model, year, part name/number, and clear photos or videos.
si: හැකි තරම් විස්තර සපයන්න: වාහන නිෂ්පාදනය, ආකෘතිය, වසර, කොටස් නම/අංකය, සහ පැහැදිලි ඡායාරූප හෝ වීඩියෝ.
ta: முடிந்தவரை விவரங்களை வழங்கவும்: வாகன தயாரிப்பு, மாதிரி, ஆண்டு, பாக பெயர்/எண் மற்றும் தெளிவான புகைப்படங்கள் அல்லது வீடியோக்கள்.

# faqTrackStatus
source: How do I track my request status?
si: මගේ ඉල්ලීමේ තත්වය මම කෙසේ ලුහුබැඳිය හැකිද?
ta: எனது கோரிக்கை நிலையை எவ்வாறு கண்காணிப்பது?

# faqTrackStatusAnswer
source: Navigate to "My Requests" to see all your requests with their current status. Tap on any request for detailed information.
si: ඔබේ සියලුම ඉල්ලීම් සහ ඒවායේ වර්තමාන තත්වය බැලීමට "මගේ ඉල්ලීම්" වෙත යන්න. සවිස්තරාත්මක තොරතුරු සඳහා ඕනෑම ඉල්ලීමක් තට්ටු කරන්න.
ta: உங்கள் அனைத்து கோரிக்கைகள் மற்றும் அவற்றின் தற்போதைய நிலையைப் பார்க்க "எனது கோரிக்கைகள்"க்குச் செல்லவும். விரிவான தகவலுக்கு எந்த கோரிக்கையையும் தட்டவும்.

source: Need More Help?
si: තවත් උදව් අවශ්‍යද?
ta: மேலும் உதவி தேவையா?

source: Still Need Help?
si: තවමත් උදව් අවශ්‍යද?
ta: இன்னும் உதவி தேவையா?

# contactSupportTeam
source: Contact our support team for assistance
si: උදව් සඳහා අපගේ සහාය කණ්ඩායම අමතන්න
ta: உதவிக்காக எங்கள் ஆதரவு குழுவைத் தொடர்பு கொள்ளவும்

source: Email
si: ඊමේල්
ta: மின்னஞ்சல்

source: Call
si: ඇමතුම
ta: அழை

source: Request Details
si: ඉල්ලීම් තොරතුරු
ta: கோரிக்கை விவரங்கள்

source: Loading request details...
si: ඉල්ලීම් තොරතුරු පූරණය වෙමින්...
ta: கோரிக்கை விவரங்களை ஏற்றுகிறது...

source: Error
si: දෝෂය
ta: பிழை

source: Failed to load request details
si: ඉල්ලීම් තොරතුරු පූරණය කිරීමට අසමත් විය
ta: கோரிக்கை விவரங்களை ஏற்ற முடியவில்லை

source: Retry
si: නැවත උත්සාහ කරන්න
ta: மீண்டும் முயற்சிக்க

source: Request not found
si: ඉල්ලීම හමු නොවීය
ta: கோரிக்கை கிடைக்கவில்லை

source: Go Back
si: ආපසු යන්න
ta: திரும்பிச் செல்ல

source: Part Information
si: කොටස් තොරතුරු
ta: பாக தகவல்

source: Part Name
si: කොටස් නම
ta: பாக பெயர்

source: Part Number
si: කොටස් අංකය
ta: பாக எண்

source: Description
si: විස්තරය
ta: விளக்கம்

source: Vehicle Information
si: වාහන තොරතුරු
ta: வாகன தகவல்

source: Vehicle Type
si: වාහන වර්ගය
ta: வாகன வகை

source: Model
si: ආකෘතිය
ta: மாதிரி

source: Year
si: වසර
ta: ஆண்டு

source: Media
si: මාධ්‍ය
ta: ஊடகம்

source: Vehicle Image
si: වාහන රූපය
ta: வாகன படம்

source: Part Image
si: කොටස් රූපය
ta: பாக படம்

source: Part Video
si: කොටස් වීඩියෝව
ta: பாக வீடியோ

source: Tap to view video
si: වීඩියෝව බැලීමට තට්ටු කරන්න
ta: வீடியோவைப் பார்க்க தட்டவும்

source: Suggested Products
si: යෝජිත නිෂ්පාදන
ta: பரிந்துரைக்கப்பட்ட தயாரிப்புகள்

# adminSuggestedProducts
source: Admin has suggested the following products for your request
si: පරිපාලකයා ඔබේ ඉල්ලීම සඳහා පහත නිෂ්පාදන යෝජනා කර ඇත
ta: நிர்வாகி உங்கள் கோரிக்கைக்கு பின்வரும் தயாரிப்புகளை பரிந்துரைத்துள்ளார்

# addedToCart
source: {productName} added to cart
si: {productName} කරත්තයට එක් කරන ලදී
ta: {productName} கார்ட்டில் சேர்க்கப்பட்டது

source: View Cart
si: කරත්තය බලන්න
ta: கார்ட்டைப் பார்க்க

# failedToAddToCart
source: Failed to add to cart: {error}
si: කරත්තයට එක් කිරීමට අසමත් විය: {error}
ta: கார்ட்டில் சேர்க்க முடியவில்லை: {error}

source: Request Information
si: ඉල්ලීම් තොරතුරු
ta: கோரிக்கை தகவல்

source: Request ID
si: ඉල්ලීම් හැඳුනුම්පත
ta: கோரிக்கை ஐடி

source: Created
si: සාදන ලද
ta: உருவாக்கப்பட்டது

source: Last Updated
si: අවසන් වරට යාවත්කාලීන කරන ලද
ta: கடைசியாக புதுப்பிக்கப்பட்டது

source: No Requests Found
si: ඉල්ලීම් හමු නොවීය
ta: கோரிக்கைகள் எதுவும் கிடைக்கவில்லை

# noRequestsFoundMessage
source: You haven't made any spare part requests yet.
si: ඔබ තවමත් උපකරණ කොටස් ඉල්ලීම් කර නැත.
ta: நீங்கள் இன்னும் எந்த ஸ்பேர் பாக கோரிக்கையும் செய்யவில்லை.

source: Billing Address
si: බිල්පත් ලිපිනය
ta: பில்லிங் முகவரி

# fillBillingAddressFields
source: Please fill in all billing address fields
si: කරුණාකර සියලුම බිල්පත් ලිපින ක්ෂේත්‍ර පුරවන්න
ta: தயவுசெய்து அனைத்து பில்லிங் முகவரி புலங்களையும் நிரப்பவும்

source: Payment
si: ගෙවීම
ta: கட்டணம்

source: Order Summary
si: ඇණවුම් සාරාංශය
ta: ஆர்டர் சுருக்கம்

source: Delete Request
si: ඉල්ලීම මකන්න
ta: கோரிக்கையை நீக்க

# deleteRequestMessage
source: Are you sure you want to delete this request? This action cannot be undone.
si: ඔබට ඇත්තටම මෙම ඉල්ලීම මකා දැමීමට අවශ්‍යද? මෙම ක්‍රියාව අහෝසි කළ නොහැකිය.
ta: இந்த கோரிக்கையை நீக்க விரும்புகிறீர்களா? இந்த செயலை திரும்பப் பெற முடியாது.

source: Deleting request...
si: ඉල්ලීම මකමින්...
ta: கோரிக்கையை நீக்குகிறது...

source: Delete
si: මකන්න
ta: நீக்க

source: Request deleted successfully
si: ඉල්ලීම සාර්ථකව මකා දමන ලදී
ta: கோரிக்கை வெற்றிகரமாக நீக்கப்பட்டது

source: Failed to delete request
si: ඉල්ලීම මකා දැමීමට අසමත් විය
ta: கோரிக்கையை நீக்க முடியவில்லை

source: Need Help?
si: උදව් අවශ්‍යද?
ta: உதவி தேவையா?

# needHelpDescription
source: Learn how to request spare parts and manage your requests
si: උපකරණ කොටස් ඉල්ලන්නේ කෙසේද සහ ඔබේ ඉල්ලීම් කළමනාකරණය කරන්නේ කෙසේද ඉගෙන ගන්න
ta: ஸ்பேர் பாகங்களை எவ்வாறு கோருவது மற்றும் உங்கள் கோரிக்கைகளை எவ்வாறு நிர்வகிப்பது என்பதை அறிக

source: Total Requests
si: සම්පූර්ණ ඉල්ලීම්
ta: மொத்த கோரிக்கைகள்

source: Pending
si: අපේක්ෂාවෙන්
ta: நிலுவையில்

source: Completed
si: සම්පූර්ණ
ta: முடிக்கப்பட்டது

source: First Name
si: මුල් නම
ta: முதல் பெயர்

source: Last Name
si: අවසන් නම
ta: கடைசி பெயர்

source: Phone Number
si: දුරකථන අංකය
ta: தொலைபேசி எண்

source: Street Address
si: වීදි ලිපිනය
ta: தெரு முகவரி

source: House number, street name
si: ගෙදර අංකය, වීදි නම
ta: வீட்டு எண், தெரு பெயர்

source: City
si: නගරය
ta: நகரம்

source: State/Province (Optional)
si: පළාත/ප්‍රාන්තය (විකල්ප)
ta: மாநிலம்/மாகாணம் (விருப்பமானது)

source: Country
si: රට
ta: நாடு

# phoneNumberRequired
source: Phone number is required
si: දුරකථන අංකය අවශ්‍යයි
ta: தொலைபேசி எண் தேவை

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
si: කරුණාකර වලංගු දුරකථන අංකයක් ඇතුළත් කරන්න
ta: சரியான தொலைபேசி எண்ணை உள்ளிடவும்

# requestSparePartTitle
source: Request Spare Part
si: උපකරණ කොටසක් ඉල්ලන්න
ta: ஸ்பேர் பாகத்தை கோரவும்

# fillInDetailsBelow
source: Fill in the details below
si: පහත විස්තර පුරවන්න
ta: கீழே உள்ள விவரங்களை நிரப்பவும்

# stepXOfY
source: Step {current} of {total}
si: පියවර {current} / {total}
ta: படி {current} / {total}

source: Tell us about your vehicle
si: ඔබේ වාහනය ගැන අපට කියන්න
ta: உங்கள் வாகனத்தைப் பற்றி எங்களுக்குச் சொல்லுங்கள்

# vehicleTypeLabel
source: Vehicle Type
si: වාහන වර්ගය
ta: வாகன வகை

# pleaseSelectVehicleType
source: Please select a vehicle type
si: කරුණාකර වාහන වර්ගයක් තෝරන්න
ta: தயவுசெய்து வாகன வகையைத் தேர்ந்தெடுக்கவும்

# vehicleModelLabel
source: Vehicle Model
si: වාහන ආකෘතිය
ta: வாகன மாதிரி

# vehicleModelHint
source: e.g., Toyota Camry
si: උදා: ටොයෝටා කැම්රි
ta: எ.கா: டொயோட்டா கேம்ரி

source: Please enter vehicle model
si: කරුණාකර වාහන ආකෘතිය ඇතුළත් කරන්න
ta: தயவுசெய்து வாகன மாதிரியை உள்ளிடவும்

# vehicleYearLabel
source: Vehicle Year
si: වාහන වසර
ta: வாகன ஆண்டு

# vehicleYearHint
source: e.g., 2020
si: උදා: 2020
ta: எ.கா: 2020

source: Please enter vehicle year
si: කරුණාකර වාහන වසර ඇතුළත් කරන්න
ta: தயவுசெய்து வாகன ஆண்டை உள்ளிடவும்

# pleaseEnterValidVehicleYear
source: Please enter a valid vehicle year
si: කරුණාකර වලංගු වාහන වසරක් ඇතුළත් කරන්න
ta: தயவுசெய்து சரியான வாகன ஆண்டை உள்ளிடவும்

source: Select Country
si: රට තෝරන්න
ta: நாட்டைத் தேர்ந்தெடுக்கவும்

# pleaseSelectCountry
source: Please select a country
si: කරුණාකර රටක් තෝරන්න
ta: தயவுசெய்து ஒரு நாட்டைத் தேர்ந்தெடுக்கவும்

# provinceStateLabel
source: Province/State
si: පළාත/ප්‍රාන්තය
ta: மாநிலம்/மாகாணம்

# provinceStateHint
source: e.g., California, Ontario, London
si: උදා: කැලිෆෝනියා, ඔන්ටාරියෝ, ලන්ඩන්
ta: எ.கா: கலிபோர்னியா, ஒன்டாரியோ, லண்டன்

source: Please enter province/state
si: කරුණාකර පළාත/ප්‍රාන්තය ඇතුළත් කරන්න
ta: தயவுசெய்து மாநிலம்/மாகாணத்தை உள்ளிடவும்

source: Vehicle Image (Optional)
si: වාහන රූපය (විකල්ප)
ta: வாகன படம் (விருப்பமானது)

source: Tap to add vehicle image
si: වාහන රූපය එක් කිරීමට තට්ටු කරන්න
ta: வாகன படத்தைச் சேர்க்க தட்டவும்

source: Spare Part Details
si: උපකරණ කොටස් තොරතුරු
ta: ஸ்பேர் பாக விவரங்கள்

# describePartYouNeed
source: Describe the part you need
si: ඔබට අවශ්‍ය කොටස විස්තර කරන්න
ta: உங்களுக்குத் தேவையான பகுதியை விவரிக்கவும்

# partNameLabel
source: Part Name
si: කොටස් නම
ta: பாக பெயர்

# partNameHint
source: e.g., Brake Pad, Engine Oil Filter
si: උදා: බ්‍රේක් පෑඩ්, එන්ජින් තෙල් පෙරහන
ta: எ.கா: பிரேக் பேட், எஞ்சின் ஆயில் வடிகட்டி

source: Please enter part name
si: කරුණාකර කොටස් නම ඇතුළත් කරන්න
ta: தயவுசெய்து பாக பெயரை உள்ளிடவும்

# partNumberLabel
source: Part Number
si: කොටස් අංකය
ta: பாக எண்

# partNumberHint
source: e.g., BP-001 (Optional)
si: උදා: BP-001 (විකල්ප)
ta: எ.கா: BP-001 (விருப்பமானது)

# descriptionLabel
source: Description
si: විස්තරය
ta: விளக்கம்

# descriptionHint
source: Detailed description of the part you need
si: ඔබට අවශ්‍ය කොටසේ සවිස්තරාත්මක විස්තරය
ta: உங்களுக்குத் தேவையான பாகத்தின் விரிவான விளக்கம்

source: Please enter description
si: කරුණාකර විස්තරය ඇතුළත් කරන්න
ta: தயவுசெய்து விளக்கத்தை உள்ளிடவும்

source: Part Image (Optional)
si: කොටස් රූපය (විකල්ප)
ta: பாக படம் (விருப்பமானது)

source: Tap to add part image
si: කොටස් රූපය එක් කිරීමට තට්ටු කරන්න
ta: பாக படத்தைச் சேர்க்க தட்டவும்

source: Part Video (Optional)
si: කොටස් වීඩියෝව (විකල්ප)
ta: பாக வீடியோ (விருப்பமானது)

source: Video selected
si: වීඩියෝව තෝරාගෙන ඇත
ta: வீடியோ தேர்ந்தெடுக்கப்பட்டது

source: Remove
si: ඉවත් කරන්න
ta: நீக்க

source: Tap to add part video
si: කොටස් වීඩියෝව එක් කිරීමට තට්ටු කරන්න
ta: பாக வீடியோவைச் சேர்க்க தட்டவும்

source: Next
si: ඊළඟ
ta: அடுத்து

source: Cancel Request
si: ඉල්ලීම අවලංගු කරන්න
ta: கோரிக்கையை ரத்துசெய்

# cancelRequestMessage
source: Are you sure you want to cancel? All entered data will be lost.
si: ඔබට ඇත්තටම අවලංගු කිරීමට අවශ්‍යද? ඇතුළත් කළ සියලුම දත්ත අහිමි වනු ඇත.
ta: நீங்கள் உண்மையில் ரத்துசெய்ய விரும்புகிறீர்களா? உள்ளிடப்பட்ட அனைத்து தரவும் இழக்கப்படும்.

source: Keep Editing
si: සංස්කරණය දිගටම කරන්න
ta: திருத்துதலைத் தொடரவும்

source: Request Submitted!
si: ඉල්ලීම ඉදිරිපත් කරන ලදී!
ta: கோரிக்கை சமர்ப்பிக்கப்பட்டது!

# requestSubmittedMessage
source: Your spare part request has been submitted successfully. You will receive quotes from suppliers soon.
si: ඔබේ උපකරණ කොටස් ඉල්ලීම සාර්ථකව ඉදිරිපත් කරන ලදී. ඔබට ඉක්මනින් සැපයුම්කරුවන්ගෙන් මිල ඇස්තමේන්තු ලැබෙනු ඇත.
ta: உங்கள் ஸ்பேர் பாக கோரிக்கை வெற்றிகரமாக சமர்ப்பிக்கப்பட்டது. விரைவில் சப்ளையர்களிடமிருந்து விலை மதிப்பீடுகள் பெறுவீர்கள்.

source: Submit Another
si: තවත් එකක් ඉදිරිපත් කරන්න
ta: மற்றொன்றை சமர்ப்பிக்கவும்

source: View Requests
si: ඉල්ලීම් බලන්න
ta: கோரிக்கைகளைப் பார்க்க

# submittingRequest
source: Submitting your request...
si: ඔබේ ඉල්ලීම ඉදිරිපත් කරමින්...
ta: உங்கள் கோரிக்கையை சமர்ப்பிக்கிறது...

# uploadingVideoFile
source: Uploading video file... This may take a few minutes
si: වීඩියෝ ගොනුව උඩුගත කරමින්... මෙය මිනිත්තු කිහිපයක් ගත විය හැකිය
ta: வீடியோ கோப்பை பதிவேற்றுகிறது... இது சில நிமிடங்கள் ஆகலாம்

# pleaseWait
source: Please wait, this may take a moment
si: කරුණාකර රැඳී සිටින්න, මෙය මොහොතක් ගත විය හැකිය
ta: தயவுசெய்து காத்திருக்கவும், இது ஒரு கணம் ஆகலாம்

source: Take Photo
si: ඡායාරූපයක් ගන්න
ta: புகைப்படம் எடுக்க

source: Choose from Gallery
si: ගැලරියෙන් තෝරන්න
ta: கேலரியிலிருந்து தேர்ந்தெடுக்க

# errorPickingImage
source: Error picking image: {error}
si: රූපය තෝරාගැනීමේ දෝෂය: {error}
ta: படத்தைத் தேர்ந்தெடுப்பதில் பிழை: {error}

# errorPickingVideo
source: Error picking video: {error}
si: වීඩියෝ තෝරාගැනීමේ දෝෂය: {error}
ta: வீடியோவைத் தேர்ந்தெடுப்பதில் பிழை: {error}

source: Current Password
si: වර්තමාන මුරපදය
ta: தற்போதைய கடவுச்சொல்

# enterCurrentPassword
source: Enter your current password
si: ඔබේ වර්තමාන මුරපදය ඇතුළත් කරන්න
ta: உங்கள் தற்போதைய கடவுச்சொல்லை உள்ளிடவும்

# currentPasswordRequired
source: Current password is required
si: වර්තමාන මුරපදය අවශ්‍යයි
ta: தற்போதைய கடவுச்சொல் தேவை

source: New Password
si: නව මුරපදය
ta: புதிய கடவுச்சொல்

# enterNewPassword
source: Enter your new password
si: ඔබේ නව මුරපදය ඇතුළත් කරන්න
ta: உங்கள் புதிய கடவுச்சொல்லை உள்ளிடவும்

# newPasswordRequired
source: New password is required
si: නව මුරපදය අවශ්‍යයි
ta: புதிய கடவுச்சொல் தேவை

source: Confirm New Password
si: නව මුරපදය තහවුරු කරන්න
ta: புதிய கடவுச்சொல்லை உறுதிப்படுத்தவும்

# confirmNewPasswordHint
source: Confirm your new password
si: ඔබේ නව මුරපදය තහවුරු කරන්න
ta: உங்கள் புதிய கடவுச்சொல்லை உறுதிப்படுத்தவும்

# pleaseConfirmPassword
source: Please confirm your password
si: කරුණාකර ඔබේ මුරපදය තහවුරු කරන්න
ta: தயவுசெய்து உங்கள் கடவுச்சொல்லை உறுதிப்படுத்தவும்
